In [1]:
# Basic Libraries
import numpy as np
import pandas as pd
import seaborn as sb
import matplotlib.pyplot as plt # we only need pyplot
sb.set() # set the default Seaborn style for graphics

# Loan Prediction based on customer behaviour
---
We have found ourselves a dataset which contains the profiles of people. We will first explore to see if there is any relationship between these variables, trying to answer the following question:
### Is there any relationship between the different variables in the dataset?
---
Afterwhich, we will try to predict whether an individual will default on a loan based on the "risk flag" inside the dataset, answering the following question:
### Which model can best predict how likely an individual will default his loan?
### Which is the most important variable for prediction?
---

## Importing the dataset

In [2]:
trainData = pd.read_csv('Training Data.csv')
trainData.head()

,Id,Income,Age,Experience,Married/Single,House_Ownership,Car_Ownership,Profession,CITY,STATE,CURRENT_JOB_YRS,CURRENT_HOUSE_YRS,Risk_Flag
0,1,1303834,23,3,single,rented,no,Mechanical_engineer,Rewa,Madhya_Pradesh,3,13,0
1,2,7574516,40,10,single,rented,no,Software_Developer,Parbhani,Maharashtra,9,13,0
2,3,3991815,66,4,married,rented,no,Technical_writer,Alappuzha,Kerala,4,10,0
3,4,6256451,41,2,single,rented,yes,Software_Developer,Bhubaneswar,Odisha,2,12,1
4,5,5768871,47,11,single,rented,no,Civil_servant,Tiruchirappalli[10],Tamil_Nadu,3,14,1

### Data preparation and cleaning

We created `Risk_Class` column by converting `Risk_Flag` into categorical variable, `0 == No Risk` and `1 == Risk`.

We have done so as `Risk_Flag` is a categorical data (`Risk` or `No Risk`) but is given in the dataset in a binary form.

In [4]:
# Creating categorical Risk_Class from numeric Risk_Flag
cleanTrainData = trainData
Risk_Class = []
for index, row in cleanTrainData.iterrows():
    if row['Risk_Flag'] == 1:
        Risk_Class.append('Risk')
    else:
        Risk_Class.append('No Risk')
cleanTrainData['Risk_Class'] = Risk_Class

In [22]:
cleanTrainData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 252000 entries, 0 to 251999
Data columns (total 13 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Income             252000 non-null  int64
 1   Age                252000 non-null  int64
 2   Experience         252000 non-null  int64
 3   Married/Single     252000 non-null  object
 4   House_Ownership    252000 non-null  object
 5   Car_Ownership      252000 non-null  object
 6   Profession         252000 non-null  object
 7   CITY               252000 non-null  object
 8   STATE              252000 non-null  object
 9   CURRENT_JOB_YRS    252000 non-null  int64
 10  CURRENT_HOUSE_YRS  252000 non-null  int64
 11  Risk_Flag          252000 non-null  int64
 12  Risk_Class         252000 non-null  object
dtypes: int64(6), object(7)
memory usage: 25.0+ MB

We have decided to drop `Id` column as we can use the index of the column instead, and export into csv for EDA

In [6]:
# Drop Id from train data
cleanTrainData =  pd.DataFrame(cleanTrainData.drop(columns = 'Id'))
cleanTrainData.head()

,Income,Age,Experience,Married/Single,House_Ownership,Car_Ownership,Profession,CITY,STATE,CURRENT_JOB_YRS,CURRENT_HOUSE_YRS,Risk_Flag,Risk_Class
0,1303834,23,3,single,rented,no,Mechanical_engineer,Rewa,Madhya_Pradesh,3,13,0,No Risk
1,7574516,40,10,single,rented,no,Software_Developer,Parbhani,Maharashtra,9,13,0,No Risk
2,3991815,66,4,married,rented,no,Technical_writer,Alappuzha,Kerala,4,10,0,No Risk
3,6256451,41,2,single,rented,yes,Software_Developer,Bhubaneswar,Odisha,2,12,1,Risk
4,5768871,47,11,single,rented,no,Civil_servant,Tiruchirappalli[10],Tamil_Nadu,3,14,1,Risk

In [7]:
# Saving cleaned train data to csv
cleanTrainData.to_csv("clean-train-data.csv", index=None, header=True)